x1 = int(input('Введите координату х веришины А '))
y1 = int(input('Введите координату y веришины А '))
x2 = int(input('Введите координату х веришины B '))
y2 = int(input('Введите координату y веришины B '))
x3 = int(input('Введите координату х веришины C '))
y3 = int(input('Введите координату y веришины C '))

dAB = ((x2 - x1)**2 + (y2 -y1)**2)**0.5
dAC = ((x3 - x1)**2 + (y3 -y1)**2)**0.5
dBC = ((x3 - x2)**2 + (y3 -y2)**2)**0.5

P = dAB + dBC + dAC
p = P/2

S = (p*(p - dAB) * (p - dAC) * (p - dBC))**0.5

print('Периметр треугольник = ', P)
print('Площадь треугольника = ', S)
